In [1]:
import pandas as pd
import numpy as np

In [11]:
filas= ['Venta1','Venta2','Venta3']
columnas = ['ZonaA','ZonaB','ZonaC']
datos = [[123,421,256],[234,541,257],[120,451,258]]

In [13]:
dataFrame= pd.DataFrame(datos,filas,columnas)

In [15]:
dataFrame

        ZonaA  ZonaB  ZonaC
Venta1    123    421    256
Venta2    234    541    257
Venta3    120    451    258

In [17]:
dataFrame.loc['Venta1']

ZonaA    123
ZonaB    421
ZonaC    256
Name: Venta1, dtype: int64

In [25]:
dataFrame.loc[['Venta1','Venta2']]

        ZonaA  ZonaB  ZonaC
Venta1    123    421    256
Venta2    234    541    257

In [35]:
dataFrame['ZonaA']

Venta1    123
Venta2    234
Venta3    120
Name: ZonaA, dtype: int64

In [41]:
dataFrame[['ZonaA','ZonaB']]

        ZonaA  ZonaB
Venta1    123    421
Venta2    234    541
Venta3    120    451